/**
 * Created by masoud on 10/27/15.
 */

var texts =
{
    ui_settings_changed : "تنظیمات جدید با موفقیت اعمال شدند.",
    ui_settings_question_one : "آیا تمایل دارید اطلاعیه ها و صورت مسائل درس ساختمان داده را دریافت کنید؟",
    ui_settings_question_two : "آیا تمایل دارید اطلاعیه ها و صورت مسائل درس طراحی الگوریتم را دریافت کنید؟",
    ui_settings_question_three : "آیا تمایل دارید اطلاعیه ها و صورت مسائل درس هوش مصنوعی را دریافت کنید؟",
    ui_settings_question_four : "آیا تمایل دارید اطلاعیه ها و صورت مسائل درس معماری کامپیوتر را دریافت کنید؟",
    ui_settings_sure : "این ها تنظمیات جدید هستند که همین الآن وارد کرده اید:\n\nتمایل دارید اطلاعیه ها و صورت مسائل دروس زیر را دریافت کنید:",
    ui_settings_sure_two : "و مایل نیستید اطلاعیه و صورت مسائل دروس زیر را دریافت کنید:",
    ui_settings_sure_three : "تنظیمات جدید اعمال شوند؟",
    ui_here_is_your_settings : "شما می توانید تعیین کنید که اطلاعیه ها و صورت مسائل چه دروسی را دریافت کنید.\n\nدر حال حاضر اطلاعیه ها و صورت مسائل دروس زیر را دریافت می کنید:",
    ui_here_is_your_settings_two : "و این ها دروسی هستند که شما اطلاعیه و صورت مسائل شان را دریافت نمی کنید:",
    ui_here_is_your_settings_three : "اگر مایل باشید می توانید تنظیمات فعلی تان را تغییر دهید:",
    ui_admin_no_files_in_news : "اطلاعیه ها نمی توانند حاوی فایل باشند. برای رسال فایل باید فرآیند را در مرحله آخر کنسل کرده و سپس به جای گزینه ارسال اطلاعیه از گزینه ارسال تمرین استفاده نمایید.",
    undefined_text : "پیام شما برای روبات تعریف نشده است. در صورتی که نیاز به راهنمایی دارید عبارت /help را لمس کنید.",
    ui_you_did_not_sent_any_files : "باید حداقل یک فایل ارسال نمایید!",
    ui_success : "✔️ تمرین های شما با موفقیت برای استاد حل تمرین ارسال شدند!",
    ui_here_is_new_exercise : "باسلام، یک تمرین جدید دریافت شد.",
    ui_are_you_sure : "این ها اطلاعات و فایل هایی هستند که شما وارد کرده اید. آیا از صحت آنان اطمینان دارید؟",
    ui_start_sending_files : "حالا فایل یا فایل های تمرین تان را ارسال نمایید. پس از ارسال همه فایل ها کلید «اتمام فایل ها» را لمس کنید.",
    ui_enter_name : "لطفا نام و نام خانوادگی خود را وارد کنید:",
    ui_no_more_files : "✔️ اتمام فایل ها",
    ui_choose_from_main_menu : "لطفا یکی از گزینه های منو را انتخاب کنید:",
    ui_choose_lesson : "تمرین های شما مربوط به چه درسی است؟\n(از میان گزینه های زیر انتخاب کنید:)",
    admin_ui_choose_lesson : "این مورد مربوط به چه درسی است؟\n(از میان گزینه های زیر انتخاب کنید:)",
    unexpected_format : "ویدئو، صوت و موارد دیگر برای روبات تعریف نشده اند.",
    unexpected_photo_or_doc : "فایل های تمرین را باید در مرحله خاصی ارسال کنید.\n(اگر نیاز به کمک دارید بر روی عبارت /help کلیک کنید.)",
    admin_files_only_on_exercise : "(در ضمن اگر می خواهید فایل ارسال کنید باید گزینه ارسال تمرین را انتخاب کنید و نه گزینه ارسال اطلاعیه را.)",
    admin_help_text : "در فرآیند ارسال تمرین یا اطلاعیه به دانشجویان، اگر پاسخ یا فایلی اشتباهی را ارسال کردید امکان کنسل کردن فرآیند و شروع مجدد در مرحله آخر وجود دارد.\nاگر کلید back گوشی را لمس کردید و یا به هر دلیل دیگری کیبورد پنهان شد، مطابق تصویر روی کلید 🔡 شکل کلیک کنید تا کیبورد دوباره ظاهر شود.",
    help_text : "در فرآیند ارسال تمرین، اگر پاسخ یا فایلی اشتباهی را ارسال کردید امکان کنسل کردن فرآیند و شروع مجدد در مرحله آخر وجود دارد.\nاگر کلید back گوشی را لمس کردید و یا به هر دلیل دیگری کیبورد پنهان شد، مطابق تصویر روی کلید 🔡 شکل کلیک کنید تا کیبورد دوباره ظاهر شود.",
    help_text_two : "در حالت عادی تمامی اطلاعیه ها و صورت مساءل تمامی دروس برای شما ارسال می شوند مگر این که از طریق گزینه تنظیمات منوی اصلی اقدام به غیر فعال کردن بعضی از دروس بکنید.",
    cancelled : "عملیات ارسال تمرین کنسل شد. می توانید از ابتدا شروع کنید.",
    admin_cancelled : "عملیات جاری کنسل شد. می توانید از ابتدا شروع کنید.",
    ui_admin_what_to_share : "می خواهید چه چیزی ارسال کنید؟",
    ui_admin_send_news : "لطفا متن اطلاعیه را ارسال نمایید:",
    ui_admin_are_you_sure_news : "این متن اطلاعیه ای است که می خواهید ارسال کنید:",
    deliver_exercise : "با سلام. استاد حل تمرین، صورت مسئله جدید ارسال کرده است: ",
    deliver_news : "با سلام. استاد حل تمرین، یک اطلاعیه جدید ارسال کرده است: ",
    admin_exercise_sent : "صورت مسائل با موفقیت ارسال شد.",
    admin_news_sent : "اطلاعیه با موفقیت ارسال شد."
}

module.exports = texts;
