/**
 * Created by masoud on 10/27/15.
 */

var texts =
{
    teacher: "هیچ پیامی برای استاد حل تمرین تعریف نشده است. روبات فعال بوده و در صورت ارسال تمرین توسط دانشجو ها، آن ها را به اطلاع شما می رساند.",
    undefined_text : "پیام شما برای روبات تعریف نشده است. در صورتی که نیاز به راهنمایی دارید عبارت /help را لمس کنید.",
    ui_you_did_not_sent_any_files : "باید حداقل یک فایل ارسال نمایید!",
    ui_success : "✔️ تمرین های شما با موفقیت برای استاد حل تمرین ارسال شدند!",
    ui_here_is_new_exercise : "باسلام، یک تمرین جدید دریافت شد.",
    ui_are_you_sure : "این ها اطلاعات و فایل هایی هستند که شما وارد کرده اید. آیا از صحت آنان اطمینان دارید؟",
    ui_start_sending_files : "حالا فایل یا فایل های تمرین تان را ارسال نمایید. پس از ارسال همه فایل ها کلید «اتمام فایل ها» را لمس کنید.",
    ui_enter_name : "لطفا نام و نام خانوادگی خود را وارد کنید:",
    ui_no_more_files : "✔️ اتمام فایل ها",
    ui_choose_from_main_menu : "لطفا یکی از گزینه های منو را انتخاب کنید:",
    ui_choose_lesson : "تمرین های شما مربوط به چه درسی است؟\n(از میان گزینه های زیر انتخاب کنید:)",
    unexpected_format : "ویدئو، صوت و موارد دیگر برای روبات تعریف نشده اند.",
    unexpected_photo_or_doc : "فایل های تمرین را باید در مرحله خاصی ارسال کنید.\n(اگر نیاز به کمک دارید بر روی عبارت /help کلیک کنید.)",
    help_text : "بعد از انتخاب گزینه ارسال تمرین باید مرحله به مرحله موارد خواسته شده را به روبات ارسال کنید. اگر پاسخ یا فایلی اشتباهی را ارسال کردید امکان کنسل کردن و فرآیند و شروع مجدد در مرحله آخر وجود دارد.\nبرای راحت تر شدن فرآیند، کیبورد های مخصوصی در اختیار شما قرار می گیرد تا پاسخ تان را انتخاب (و نه تایپ) کنید.\n(اگر کلید back گوشی را لمس کردید و یا به هر دلیل دیگری کیبورد پنهان شد، مطابق تصویر روی کلید 🔡 شکل کلیک کنید تا کیبورد دوباره ظاهر شود.)",
    cancelled : "عملیات ارسال تمرین کنسل شد. می توانید از ابتدا شروع کنید."
}

module.exports = texts;
